/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isspace.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: rnakatan <rnakatan@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/12/12 00:00:00 by rnakatan          #+#    #+#             */
/*   Updated: 2025/12/12 00:00:00 by rnakatan         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "utils.h"

/**
 * @brief 文字が空白文字（スペースまたはタブ）かどうかを判定する
 * 
 * @param c 判定する文字
 * @return int 空白文字の場合は1、それ以外は0
 */
int	ft_isspace(int c)
{
	return (c == ' ' || c == '\t');
}
